application/bir_dwts/backend/controllers/DocumentCategoryController.php

    protected function findModel($id)
    {
        if (($model = DocumentCategory::findOne($id)) !== null) {
---
SELECT * FROM `document_category` WHERE `id`='1'