application/bir_dwts/backend/views/document/index.php

    ?>

    <?php
    $gridColumns = [
            [
                'class' => 'kartik\grid\ExpandRowColumn',
                'value' => function ($model, $key, $index, $column) {
                    return GridView::ROW_COLLAPSED;
                },
                'detail' => function ($model, $key, $index, $column) {
                    $searchModel = new DocumentWorkflowSearch();
                    $searchModel->document_id = $model->document_tracking_number;
                    $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

                    return Yii::$app->controller->renderPartial('_docworkflowPartialView',[
                            'searchModel' => $searchModel,
                            'dataProvider' => $dataProvider,
                        ]);
                },
            ],
//            'id',
            'document_tracking_number',
            'document_name',
 //           'document_description',
            [
                'attribute' => 'document_target_date',
---
SELECT * FROM `document` LIMIT 20
SELECT COUNT(*) FROM `document`